# 위 코드는 Python 3.8.6 64-bit 로 작성되었으며 pygame 1.9.6 버전으로 작성되었습니다.
# encodeing: UTF8, editior: Visual Studio Code from misrosoft
# please install pygame module
# This code was produced on October 20, 2020 by mine_coder

#####################################################################################################################################################################################
# 모듈 불러오기
import pygame
import os
######################################################################################################################################################################################

# 게임 초기화 (반드시 필요)
pygame.init()

# 화면 크키 설정
screen_width = 480 # 가로 크키
screen_height = 640 # 세로 크키
screen = pygame.display.set_mode((screen_width, screen_height))

# 화면 타이틀 설정
pygame.display.set_caption("Game name")

# FPS
clock = pygame.time.Clock()

# 배경화면 만들기
pygame.image.load()



##########################################################################################################################################################################################
# 메인 이벤트 루프 실행
##########################################################################################################################################################################################

# 1. 사옹자 게임 초기화 ( 배경 화면, 게임 이미지, 좌표, 속고, 폰트 등)

running = True
while running:
    dt = clock.tick(30)

    # 2. 이벤트 처리
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            running = False
           
        
    # 3. 게임 캐릭터 위지 정의

    # 4. 충돌 처리

    # 5. 화면에 그리기

    pygame.display.update()

##########################################################################################################################################################################################
# 메인 이벤트 루프 종료
##########################################################################################################################################################################################

pygame.quit()

# make by [mine coder]